biddr_api/app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions" ORDER BY created_at DESC
---
  def index
    @auctions = Auction.all.order("created_at DESC")

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
---
  def show
    @auction = Auction.find params[:id]