biddr_api/app/controllers/api/v1/auctions_controller.rb

  def show
    @auction = Auction.find(params[:id])
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]

  def create
    auction = Auction.new auction_params
    auction.user = current_user
    if auction.save
---
INSERT INTO "auctions" ("title", "description", "created_at", "updated_at", "ends_at", "reserve_price", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def find_auction
    @auction||=Auction.find params[:id]
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]