biddr_api/app/controllers/api/v1/bids_controller.rb

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
INSERT INTO "bids" ("description", "auction_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "52"], ["auction_id", 23], ["created_at", "2021-01-10 06:27:20.588470"], ["updated_at", "2021-01-10 06:27:20.588470"], ["user_id", 5]]
---
  def create
    auction= Auction.find params[:auction_id]
    bid = Bid.new params.require(:bid).permit(:description)
    bid.auction = auction
    bid.user= current_user
    if bid.save