biddr_api/app/controllers/api/v1/users_controller.rb

  def create
    user = User.new params.permit(
      :first_name,
      :last_name,
      :email,
      :password,
      :password_confirmation
    )
    if user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"